In [58]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime

In [59]:
df = pd.read_csv('Customer.csv')

In [60]:
df

,Customer ID,Name,Surname,Gender,Birthdate,Transaction Amount,Date,Merchant Name,Category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,NaN,1985-10-24,2552.72,2023-07-17,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
49995,891845,Christine,Leach,F,1997-10-21,108.74,2023-08-30,Alexander Ltd,Market
49996,800560,Anna,Allen,F,1999-10-21,133.66,2023-05-03,Knapp-Calhoun,Cosmetic
49997,133285,Nicole,Franklin,M,1979-10-26,464.29,2023-02-12,"Cantrell, Haynes and Ballard",Market
49998,616122,Maria,Keller,M,1981-10-25,472.57,2023-03-25,"Wilson, Jackson and Beard",Market
49999,832184,Billy,Walker,F,1958-10-31,270.67,2023-05-20,Combs LLC,Market

In [61]:
df.rename(columns={'Customer ID' : 'Musteri_ID',
                   'Name':'Isim',
                   'Surname':'Soyisim',
                   'Gender':'Cinsiyet',
                   'Birthdate':'Dogum_Tarihi',
                   'Transaction Amount':'Yapilan_Harcama',
                   'Date':'Harcama_Tarihi',
                   'Merchant Name':'Satici',
                   'Category':'Kategori'}, inplace=True)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Musteri_ID       50000 non-null  int64
 1   Isim             50000 non-null  object
 2   Soyisim          50000 non-null  object
 3   Cinsiyet         44953 non-null  object
 4   Dogum_Tarihi     50000 non-null  object
 5   Yapilan_Harcama  50000 non-null  float64
 6   Harcama_Tarihi   50000 non-null  object
 7   Satici           50000 non-null  object
 8   Kategori         50000 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 3.4+ MB

In [63]:
df.isnull().sum()

Musteri_ID            0
Isim                  0
Soyisim               0
Cinsiyet           5047
Dogum_Tarihi          0
Yapilan_Harcama       0
Harcama_Tarihi        0
Satici                0
Kategori              0
dtype: int64

In [64]:
df = df.dropna()

In [65]:
df.isnull().sum()

Musteri_ID         0
Isim               0
Soyisim            0
Cinsiyet           0
Dogum_Tarihi       0
Yapilan_Harcama    0
Harcama_Tarihi     0
Satici             0
Kategori           0
dtype: int64

In [66]:
duplicates = pd.DataFrame({'HasDuplicates': [df.duplicated().any()]})
duplicates

   HasDuplicates
0          False

In [67]:
df.shape

(44953, 9)

In [70]:
df.loc[:,('Dogum_Tarihi')] = pd.to_datetime(df.loc[:,('Dogum_Tarihi')]) # Tarih formatına dönüşüm
df.loc[:,('Yas')] = df.loc[:,('Dogum_Tarihi')].apply(lambda x: (datetime.now().year - x.year)) # Hesaplama

print(df['Yas'])

0        22
2        43
3        47
4        73
5        23
         ..
49995    27
49996    25
49997    45
49998    43
49999    66
Name: Yas, Length: 44953, dtype: int64

In [71]:
df.loc[:,'Ay']=df.loc[:,'Harcama_Tarihi'].str.slice(5,7)

In [85]:
df.loc[:,'Cinsiyet'] = df.loc[:,'Cinsiyet'].replace({'F': 1, 'M': 0})
df.loc[:,'Cinsiyet'] = pd.to_numeric(df.loc[:,'Cinsiyet'], errors='coerce', downcast='integer')
df.loc[:,'Ay'] = pd.to_numeric(df.loc[:,'Ay'], errors='coerce', downcast='integer')

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44953 entries, 0 to 49999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Musteri_ID       44953 non-null  int64
 1   Isim             44953 non-null  object
 2   Soyisim          44953 non-null  object
 3   Cinsiyet         44953 non-null  int8
 4   Dogum_Tarihi     44953 non-null  object
 5   Yapilan_Harcama  44953 non-null  float64
 6   Harcama_Tarihi   44953 non-null  object
 7   Satici           44953 non-null  object
 8   Kategori         44953 non-null  object
 9   Yas              44953 non-null  int64
 10  Ay               44953 non-null  int8
dtypes: float64(1), int64(2), int8(2), object(6)
memory usage: 3.5+ MB

In [87]:
df.loc[:,'Ay'] = pd.to_numeric(df.loc[:,'Ay'], errors='coerce', downcast='integer')

In [88]:
df.describe() #'F': 1, 'M': 0

,Musteri_ID,Cinsiyet,Yapilan_Harcama,Yas,Ay
count,44953.000000,44953.000000,44953.000000,44953.000000,44953.000000
mean,500291.017307,0.505261,442.996086,47.534736,5.250729
std,288276.249030,0.499978,632.486149,16.822202,2.730848
min,29.000000,0.000000,5.010000,19.000000,1.000000
25%,251207.000000,0.000000,79.200000,33.000000,3.000000
50%,499534.000000,1.000000,182.360000,48.000000,5.000000
75%,749999.000000,1.000000,471.820000,62.000000,8.000000
max,999997.000000,1.000000,2999.880000,76.000000,10.000000